#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_project_service.run: Refreshing state... [id=torah-anytime-to-podcast/run.googleapis.com]
google_cloud_run_service.rss-service: Refreshing state... [id=locations/us-central1/namespaces/torah-anytime-to-podcast/services/rss-service]
google_cloud_run_domain_mapping.rss-service: Refreshing state... [id=locations/us-central1/namespaces/torah-anytime-to-podcast/domainmappings/beta.torahanytimetopodcast.2159295.xyz]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/torah-anytime-to-podcast/locations/us-central1/services/rss-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.rss-service must be replaced
-/+ resource "google_cloud_run_domain_mapping" "rss-service" {
      ~ id       = "locations/us-central1/namespaces/torah-anytime-to-podcast/domainmappings/beta.torahanytimetopodcast.2159295.xyz" -> (known after apply)
        name     = "beta.torahanytimetopodcast.2159295.xyz"
      ~ project  = "torah-anytime-to-podcast" -> (known after apply)
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Successfully deleted."
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Successfully deleted."
                      - reason  = ""
                      - status  = "False"
                      - type    = "DomainRoutable"
                    },
                ]
              - mapped_route_name   = ""
              - observed_generation = 1
              - resource_records    = []
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "run.googleapis.com/launch-stage"  = "BETA"
              - "serving.knative.dev/creator"      = "mosheygrunwald@gmail.com" -> null
              - "serving.knative.dev/lastModifier" = "mosheygrunwald@gmail.com" -> null
            }
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "us-central1"
            } -> (known after apply)
          ~ resource_version = "AAW4pjXVP0E" -> (known after apply)
          ~ self_link        = "/apis/domains.cloudrun.com/v1/namespaces/273260295179/domainmappings/beta.torahanytimetopodcast.2159295.xyz" -> (known after apply)
          ~ uid              = "8367ce40-2e95-41d5-a80d-f6820ba1e9cf" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
          ~ route_name       = "rss-service" -> "beta-rss-service" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # google_cloud_run_service.beta-rss-service will be created
  + resource "google_cloud_run_service" "beta-rss-service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "beta-rss-service"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 50

              + containers {
                  + image = "gcr.io/torah-anytime-to-podcast/main_server:beta"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + beta-url = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @TheBestMoshe, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*